from typing import List

from .கருவிகள் import சுத்தமான_உரை
from .வெளியீடு import வெளியீடு
from ..உருப்படி import உருப்படி
from ..எண் import எண்
from ..கருவிகள் import எழுத்தாளர்_வடிவம்
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி, முக்கால்ப்புள்ளி, அடைப்பு
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை
from ...வடிவம் import உரை_வடிவம்


class கட்டுரை(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)

        தன்.ஆய்விதழ் = சுத்தமான_உரை(தகவல்கள்["journal"])
        தன்.தொகுதி = தகவல்கள்["volume"] if "volume" in தகவல்கள் else None
        தன்.எண் = தகவல்கள்["number"] if "number" in தகவல்கள் else None

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.வெளியீட்டின்_மொழி, மூல்_சாபி="வெளியீடு")
        ஆய்விதழ் = மொழிபெயர்ப்புடன்_உரை(
            உரை=தன்.ஆய்விதழ்,
            மூல்_மொழி=தன்.வெளியீட்டின்_மொழி,
            மூல்_சாபி="வெளியீடு",
            வடிவம்=உரை_வடிவம்(சாய்வு=True)
        )

        தொகுதி = []
        if தன்.தொகுதி is not None:
            தொகுதி = [
                இடைவெளி(),
                எண்(int(தன்.தொகுதி)),

            ]
            if தன்.எண் is not None:
                தொகுதி.extend([
                    அடைப்பு("தொடக்கம்"),
                    எண்(int(தன்.எண்)),
                    அடைப்பு("முடிவு"),
                ])
            தொகுதி.extend([முக்கால்ப்புள்ளி(), இடைவெளி()])

        பக்கங்கள் = தன்.பக்கங்களை_வெளியிடு()
        if len(பக்கங்கள்):
            பக்கங்கள் = [
                இடைவெளி(),
                *பக்கங்கள்,
                முற்றுபுள்ளி()
            ]

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆய்விதழ்,
            முற்றுபுள்ளி(),
            *தொகுதி,
            *பக்கங்கள்,
        ]

        எண்ணிம_ஆவணச்சுட்டி = தன்.எண்ணிம_ஆவணச்சுட்டியை_வெளியிடு()
        if எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), *எண்ணிம_ஆவணச்சுட்டி]
            )

        return பத்தி_உரைகள்
