from typing import Iterator

from pyfranc import franc

from .வெளியீடு import வெளியீடு, wuj
from ..உருப்படி import உருப்படி
from ..உரை import உரை
from ..எண் import எண்
from ..கருவிகள் import எழுத்தாளர்_வடிவம்
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import இணைப்புச்சிறுகோடு, முற்றுபுள்ளி, இடைவெளி, அரைகால்ப்புள்ளி
from ..பத்தி import பத்தி, பத்தி_வடிவம்
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை, மொழிபெயர்க்கக்கூடிய_உரை
from ...மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ...வடிவம் import உரை_வடிவம், தேவையான_வடிவங்கள்


class கட்டுரை(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__()

        தன்.எழுத்தாளர்_வடிவூட்டி = எழுத்தாளர்_வடிவூட்டி

        தன்.அடையாளம் = தகவல்கள்["ID"]
        தன்.தலைப்பு = தகவல்கள்["title"]
        தன்.ஆய்விதழ் = தகவல்கள்["journal"]
        தன்.ஆண்டு = int(தகவல்கள்["year"])
        தன்.எழுத்தாளர்கள் = தகவல்கள்["author"].split(" and ")
        தன்.எண்ணிம_ஆவணச்சுட்டி = தகவல்கள்["doi"] if "doi" in தகவல்கள் else None
        தன்.பக்கங்கள் = தகவல்கள்["pages"] if "pages" in தகவல்கள் else None

        try:
            தன்.கட்டுரையின்_மொழி = wuj.runuk(
                தகவல்கள்["language"] if "language" in தகவல்கள் else franc.lang_detect(தன்.தலைப்பு)[0][0]
            )
        except ValueError:
            தன்.கட்டுரையின்_மொழி = franc.lang_detect(தன்.தலைப்பு)[0][0]
        try:
            தன்.இதழின்_மொழி = wuj.runuk(
                franc.lang_detect(தன்.ஆய்விதழ்)[0][0]
            )
        except ValueError:
            தன்.இதழின்_மொழி = franc.lang_detect(தன்.ஆய்விதழ்)[0][0]

    def உருப்படிகள்(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterator[
        "உருப்படி"]:
        எழுத்தாளர்கள் = []
        for எழுத்தாளர் in தன்.எழுத்தாளர்கள்:
            if len(எழுத்தாளர்கள்):
                எழுத்தாளர்கள்.extend(
                    [அரைகால்ப்புள்ளி(மொழி=மொழி), இடைவெளி(மொழி=மொழி)]
                )
            எழுத்தாளர்கள்.append(
                உரை(
                    எழுத்தாளர்,
                    மொழி=மொழி,
                    வடிவம்=தன்.எழுத்தாளர்_வடிவூட்டி.வடிவம்(எழுத்தாளர்) if தன்.எழுத்தாளர்_வடிவூட்டி else None
                )
            )

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.கட்டுரையின்_மொழி)
        ஆய்விதழ் = மொழிபெயர்ப்புடன்_உரை(
            உரை=தன்.ஆய்விதழ்,
            மூல்_மொழி=தன்.கட்டுரையின்_மொழி or தன்.இதழின்_மொழி,
            வடிவம்=உரை_வடிவம்(சாய்வு=True)
        )
        பக்கங்கள் = [எண்(தன்.பக்கங்கள்[0]), இணைப்புச்சிறுகோடு(), எண்(தன்.பக்கங்கள்[1])] if தன்.பக்கங்கள் else []

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(மொழி=மொழி),
            இடைவெளி(மொழி=மொழி),
            ஆண்டு,
            முற்றுபுள்ளி(மொழி=மொழி),
            இடைவெளி(மொழி=மொழி),
            தலைப்பு,
            முற்றுபுள்ளி(மொழி=மொழி),
            இடைவெளி(மொழி=மொழி),
            ஆய்விதழ்,
            *பக்கங்கள்,
            முற்றுபுள்ளி(மொழி=மொழி),
            இடைவெளி(மொழி=மொழி),
        ]

        if தன்.எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [மொழிபெயர்க்கக்கூடிய_உரை(உரை="doi:", மூல்_மொழி="eng"), உரை(தன்.எண்ணிம_ஆவணச்சுட்டி, மொழி=மொழி)])

        yield பத்தி(பத்தி_உரைகள், பத்தி_வடிவம்())

    def மொழியாக்கத்துக்காக(தன்) -> dict[str, dict[str, str]]:
        return {
            தன்.கட்டுரையின்_மொழி: {
                f"{தன்.அடையாளம்}.தலைப்பு": தன்.தலைப்பு,
                தன்.ஆய்விதழ்: தன்.ஆய்விதழ்
            }
        }
