from typing import List

from .வெளியீடு import வெளியீடு
from ..உருப்படி import உருப்படி
from ..உரை import உரை
from ..கருவிகள் import எழுத்தாளர்_வடிவம்
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை, மொழிபெயர்க்கக்கூடிய_உரை
from ...வடிவம் import உரை_வடிவம்


class கட்டுரை(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)

        தன்.ஆய்விதழ் = தகவல்கள்["journal"]

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.வெளியீட்டின்_மொழி)
        ஆய்விதழ் = மொழிபெயர்ப்புடன்_உரை(
            உரை=தன்.ஆய்விதழ்,
            மூல்_மொழி=தன்.வெளியீட்டின்_மொழி,
            வடிவம்=உரை_வடிவம்(சாய்வு=True)
        )
        பக்கங்கள் = தன்.பக்கங்களை_வெளியிடு()
        if len(பக்கங்கள்):
            பக்கங்கள் = [
                இடைவெளி(),
                *பக்கங்கள்,
                முற்றுபுள்ளி()
            ]

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆய்விதழ்,
            முற்றுபுள்ளி(),
            *பக்கங்கள்,
        ]

        if தன்.எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), மொழிபெயர்க்கக்கூடிய_உரை(உரை="doi:", மூல்_மொழி="eng"), உரை(தன்.எண்ணிம_ஆவணச்சுட்டி)])

        return பத்தி_உரைகள்

    def மொழியாக்கத்துக்காக(தன்) -> dict[str, dict[str, str]]:
        return {
            தன்.வெளியீட்டின்_மொழி: {
                f"{தன்.அடையாளம்}.தலைப்பு": தன்.தலைப்பு,
                தன்.ஆய்விதழ்: தன்.ஆய்விதழ்
            }
        }
