from typing import List

from .வெளியீடு import வெளியீடு
from ..உருப்படி import உருப்படி
from ..உரை import உரை
from ..கருவிகள் import எழுத்தாளர்_வடிவம்
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை, மொழிபெயர்க்கக்கூடிய_உரை


class நூல்(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.வெளியீட்டின்_மொழி)

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
        ]

        if தன்.எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), மொழிபெயர்க்கக்கூடிய_உரை(உரை="doi:", மூல்_மொழி="eng"), உரை(தன்.எண்ணிம_ஆவணச்சுட்டி)])

        return பத்தி_உரைகள்
