from typing import Iterator

from .வெளியீடு import வெளியீடு
from ..உருப்படி import உருப்படி
from ..உரை import உரை
from ..கருவிகள் import எழுத்தாளர்_வடிவம்
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி
from ..பத்தி import பத்தி_வடிவம், பத்தி
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை, மொழிபெயர்க்கக்கூடிய_உரை
from ...மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ...வடிவம் import தேவையான_வடிவங்கள்


class நூல்(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)

    def உருப்படிகள்(
            தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்
    ) -> Iterator["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.வெளியீட்டின்_மொழி)

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
        ]

        if தன்.எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), மொழிபெயர்க்கக்கூடிய_உரை(உரை="doi:", மூல்_மொழி="eng"), உரை(தன்.எண்ணிம_ஆவணச்சுட்டி)])

        yield பத்தி(பத்தி_உரைகள், பத்தி_வடிவம்())

    def மொழியாக்கத்துக்காக(தன்) -> dict[str, dict[str, str]]:
        return {
            தன்.வெளியீட்டின்_மொழி: {
                f"{தன்.அடையாளம்}.தலைப்பு": தன்.தலைப்பு,
            }
        }
