from typing import List

from .கருவிகள் import சுத்தமான_உரை
from .வெளியீடு import வெளியீடு
from ..உருப்படி import உருப்படி
from ..உரை import உரை
from ..எண் import எண்
from ..கருவிகள் import எழுத்தாளர்_வடிவம், மொழியைக்_கண்டுப்பிடி
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி, முக்கால்ப்புள்ளி
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை, மொழிபெயர்க்கக்கூடிய_உரை
from ...வடிவம் import உரை_வடிவம்


class நூல்_அத்தியாயம்(வெளியீடு):
    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None
    ):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)
        தன்.வெளியீட்டாளர் = தகவல்கள்["publisher"] if "publisher" in தகவல்கள் else None
        தன்.பன்னாட்டுத்_தரப்புத்தக_எண் = தகவல்கள்["isbn"] if "isbn" in தகவல்கள் else None
        தன்.நூல்_தலைப்பு = சுத்தமான_உரை(தகவல்கள்["booktitle"])
        தன்.புதிப்பு = தகவல்கள்["edition"] if "edition" in தகவல்கள் else None

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=தன்.தலைப்பு, மூல்_மொழி=தன்.வெளியீட்டின்_மொழி, மூல்_சாபி="வெளியீடு")

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            மொழிபெயர்க்கக்கூடிய_உரை("இதில்:", மூல்_மொழி="த", மூல்_சாபி="வெளியீடு"),
            இடைவெளி(),
            மொழிபெயர்ப்புடன்_உரை(
                தன்.நூல்_தலைப்பு, மூல்_மொழி=மொழியைக்_கண்டுப்பிடி(தன்.நூல்_தலைப்பு),
                மூல்_சாபி="வெளியீடு",
                வடிவம்=உரை_வடிவம்(சாய்வு=True)
            ),
            முற்றுபுள்ளி(),
        ]

        if தன்.வெளியீட்டாளர்:
            பத்தி_உரைகள்.extend([
                இடைவெளி(),
                மொழிபெயர்க்கக்கூடிய_உரை("வெளியீட்டாளர்", மூல்_சாபி="வெளியீடு", மூல்_மொழி="த"),
                முக்கால்ப்புள்ளி(),
                இடைவெளி(),
                மொழிபெயர்ப்புடன்_உரை(
                    தன்.வெளியீட்டாளர், மூல்_மொழி="த", மூல்_சாபி="வெளியீடு",
                    வடிவம்=உரை_வடிவம்(சாய்வு=True)
                ),
                முற்றுபுள்ளி(),
            ])

        if தன்.புதிப்பு:
            பத்தி_உரைகள்.extend([
                இடைவெளி(),
                மொழிபெயர்க்கக்கூடிய_உரை("பதிப்பு", மூல்_மொழி="த", மூல்_சாபி="வெளியீடு"),
                இடைவெளி(),
                எண்(int(தன்.புதிப்பு)),
                முற்றுபுள்ளி(),
            ])

        if தன்.பன்னாட்டுத்_தரப்புத்தக_எண்:
            பத்தி_உரைகள்.extend([
                இடைவெளி(),
                மொழிபெயர்க்கக்கூடிய_உரை("பன்னாட்டுத் தரப்புத்தக எண்", மூல்_மொழி="த", மூல்_சாபி="வெளியீடு"),
                முக்கால்ப்புள்ளி(),
                இடைவெளி(),
                உரை(தன்.பன்னாட்டுத்_தரப்புத்தக_எண்),
                முற்றுபுள்ளி(),
            ])

        எண்ணிம_ஆவணச்சுட்டி = தன்.எண்ணிம_ஆவணச்சுட்டியை_வெளியிடு()
        if எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), *எண்ணிம_ஆவணச்சுட்டி]
            )

        return பத்தி_உரைகள்
