from typing import List

from .வெளியீடு import வெளியீடு
from .. import உருப்படி
from ..கருவிகள் import எழுத்தாளர்_வடிவூட்டு, உள்ளீடு_உரை
from ..தேதி import தேதி
from ..நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி
from ..மொழி_உரை import மொழிபெயர்ப்புடன்_உரை
from ...வடிவூட்டு import உரை_வடிவூட்டு


class மாநாடு_கட்டுரை(வெளியீடு):

    def __init__(
            தன்,
            தகவல்கள்: dict[str, str],
            எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவூட்டு = None):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)
        தன்.ஆய்விதழ் = தகவல்கள்["booktitle"].replace("{", "").replace("}", "") if "booktitle" in தகவல்கள் else None

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(உரை=உள்ளீடு_உரை(தன்.தலைப்பு, தன்.வெளியீட்டின்_மொழி), மூல்_சாபி="வெளியீடு")
        ஆய்விதழ் = மொழிபெயர்ப்புடன்_உரை(
            உரை=உள்ளீடு_உரை(தன்.ஆய்விதழ், தன்.வெளியீட்டின்_மொழி),
            மூல்_சாபி="வெளியீடு",
            வடிவூட்டு=உரை_வடிவூட்டு(சாய்வு=True),
        ) if தன்.ஆய்விதழ் else None

        பக்கங்கள் = தன்.பக்கங்களை_வெளியிடு()
        if len(பக்கங்கள்):
            பக்கங்கள் = [
                இடைவெளி(),
                *பக்கங்கள்,
                முற்றுபுள்ளி()
            ]

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆய்விதழ்,
            முற்றுபுள்ளி(),
            *பக்கங்கள்,
        ]

        எண்ணிம_ஆவணச்சுட்டி = தன்.எண்ணிம_ஆவணச்சுட்டியை_வெளியிடு()
        if எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend(
                [இடைவெளி(), *எண்ணிம_ஆவணச்சுட்டி]
            )

        return பத்தி_உரைகள்
