import uuid
from typing import Iterable, Iterator

from odfdo import Table, Element, Cell

from .உருப்படி import உருப்படி
from ..மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவம் import உரை_வடிவம், தேவையான_வடிவங்கள்


class அட்டவணை(உருப்படி):
    def __init__(தன், வரிசைகள்: list["வரிசை"], வடிவம்: "உரை_வடிவம்" = None):
        super().__init__()
        தன்.வரிசைகள் = வரிசைகள்
        தன்.வடிவம் = வடிவம் or உரை_வடிவம்()

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        வடிவங்கள்.சேரு(தன்.வடிவம்)

        அகலம் = max(len(வ) for வ in தன்.வரிசைகள்)
        அட்டவணை_உருப்படி = Table(str(uuid.uuid4()), width=அகலம், height=len(தன்.வரிசைகள்), style=தன்.வடிவம்.பெயர்)

        for இ, வ in enumerate(தன்.வரிசைகள்):
            for ஈ, கலம் in enumerate(வ.வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)):
                அட்டவணை_உருப்படி.set_cell((ஈ, இ), கலம்)

        yield அட்டவணை_உருப்படி

    def உருப்படிகள்(தன்) -> Iterator["வரிசை"]:
        for வ in தன்.வரிசைகள்:
            yield வ


class வரிசை(உருப்படி):
    def __init__(தன், கலங்கள்: list["கலம்"]):
        super().__init__()
        தன்.கலங்கள் = கலங்கள்

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        for க in தன்.கலங்கள்:
            cell = Cell()
            for இ in க.வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்):
                cell.append(இ)

            yield cell

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        for க in தன்.கலங்கள்:
            yield க

    def __len__(தன்):
        return len(தன்.கலங்கள்)


class கலம்(உருப்படி):
    def __init__(தன், உருப்படிகள்: list[உருப்படி]):
        super().__init__()
        தன்._உருப்படிகள் = உருப்படிகள்

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        for க in தன்._உருப்படிகள்:
            yield from க.வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        for உரு in தன்._உருப்படிகள்:
            yield உரு