from typing import Iterable

from odfdo import Element, Span

from .உருப்படி import உருப்படி
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவூட்டு import உரை_வடிவூட்டு, தேவையான_வடிவங்கள்


class உரை(உருப்படி):
    def __init__(தன், உரை: str, வடிவூட்டு: "உரை_வடிவூட்டு" = None):
        super().__init__()
        தன்.உரை = உரை
        தன்.வடிவூட்டு = வடிவூட்டு or உரை_வடிவூட்டு()

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        வடிவங்கள்.சேரு(தன்.வடிவூட்டு)

        yield Span(தன்.உரை, style=தன்.வடிவூட்டு.பெயர்)
