from typing import Iterator, Optional

from .உருப்படி import உருப்படி
from .கருவிகள் import உள்ளீடு_உரை, உள்ளீடு_உரையாக
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class தலைப்பு(உருப்படி):
    உரை: உள்ளீடு_உரை

    def __init__(தன், உரை: str | உள்ளீடு_உரை, மூல்_சாபி: Optional[str] = "தலைப்பு"):
        super().__init__()
        தன்.உரை = உள்ளீடு_உரையாக(உரை)
        தன்.மூல்_சாபி = மூல்_சாபி

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=16, தடிமன்=True)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0.3)
        yield பத்தி(
            [மொழிபெயர்க்கக்கூடிய_உரை(உரை=தன்.உரை, மூல்_சாபி=தன்.மூல்_சாபி, வடிவம்=வடிவம்)],
            வடிவம்=பத்தியின்_வடிவம்,
        )
