from typing import Iterator

from .உருப்படி import உருப்படி
from .கருவிகள் import உள்ளீடு_உரை
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவூட்டு import உரை_வடிவூட்டு, பத்தி_வடிவூட்டு


class தலைப்பு(உருப்படி):
    உரை: உள்ளீடு_உரை

    def __init__(தன், உரை: str | உள்ளீடு_உரை):
        super().__init__()
        தன்.உரை = உரை if isinstance(உரை, உள்ளீடு_உரை) else உள்ளீடு_உரை(உரை)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவூட்டு = உரை_வடிவூட்டு(அளவு=16, தடிமன்=True)
        பத்தியின்_வடிவூட்டு = பத்தி_வடிவூட்டு(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0.3)
        yield பத்தி(
            [மொழிபெயர்க்கக்கூடிய_உரை(உரை=தன்.உரை, மூல்_சாபி="தலைப்பு", வடிவூட்டு=வடிவூட்டு)],
            வடிவூட்டு=பத்தியின்_வடிவூட்டு
        )
