from typing import Iterator, Iterable

from odfdo import Paragraph

from .உருப்படி import உருப்படி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவம் import உரை_வடிவம், தேவையான_வடிவங்கள்
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்


class தலைப்பு(உருப்படி):
    உரை: str
    மூல்_மொழி: str

    def __init__(தன், உரை: str, மூல்_மொழி: str):
        super().__init__()
        தன்.உரை = உரை
        தன்.மூல்_மொழி = மூல்_மொழி

    def மொழியாக்கத்துக்காக(தன்) -> dict[str, dict[str, str]]:
        return {தன்.மூல்_மொழி: {தன்.உரை: தன்.உரை}}

    def உருப்படிகள்(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=20)
        yield மொழிபெயர்க்கக்கூடிய_உரை(உரை=தன்.உரை, மூல்_மொழி=தன்.மூல்_மொழி, வடிவம்=வடிவம்)

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Paragraph]:
        தலைப்புக்கு_பத்தி = Paragraph()
        உரை = super().வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)
        தலைப்புக்கு_பத்தி.extend(உரை)
        yield தலைப்புக்கு_பத்தி
