from typing import Iterator

from .உருப்படி import உருப்படி
from .கருவிகள் import உள்ளீடு_உரை
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class தொடர்புகள்(உருப்படி):
    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=16, தடிமன்=True)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0.3)
        yield பத்தி(
            [மொழிபெயர்க்கக்கூடிய_உரை(உள்ளீடு_உரை(தன்.உரை, தன்.மூல்_மொழி), மூல்_சாபி="தலைப்பு", வடிவம்=வடிவம்)],
            வடிவம்=பத்தியின்_வடிவம்
        )