from typing import Iterator, Iterable, Optional

from .உருப்படி import உருப்படி
from .உரை import உரை
from .எண் import எண்_உரை
from .கருவிகள் import உள்ளீடு_உரையாக
from .நிறுத்தற்குறிகள் import இடைவெளி, குத்தான_கோடு
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class தொடர்புகள்(உருப்படி):
    def __init__(தன், தகவல்கள்: Iterable["தொடர்பு"]):
        super().__init__()
        தன்.தகவல்கள் = தகவல்கள்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=16, தடிமன்=True)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0.3)

        உருப்படிகள் = []
        for ப in தன்.தகவல்கள்:
            if len(உருப்படிகள்):
                உருப்படிகள்.extend([இடைவெளி(), குத்தான_கோடு(), இடைவெளி()])
            உருப்படிகள்.extend(ப.உருப்படிகள்())

        yield பத்தி(உருப்படிகள், வடிவம்=பத்தியின்_வடிவம்)


class தொடர்பு(உருப்படி):
    def __init__(தன், தகவல்: str, சின்னம்: Optional[str] = None):
        super().__init__()
        தன்.சின்னம் = சின்னம்
        தன்.தகவல் = தகவல்

    def உருப்படிகள்(தன்) -> Iterator[உருப்படி]:
        if தன்.சின்னம்:
            yield உரை(தன்.சின்னம்)
            yield இடைவெளி()
        yield தன்.தகவல்_உருப்படி()

    def தகவல்_உருப்படி(தன்) -> உருப்படி:
        return உரை(தன்.தகவல்)


class இணையத்தளப்_பக்கம்(தொடர்பு):
    def __init__(தன், முகவரி: str, சின்னம்="🌐"):
        super().__init__(சின்னம்=சின்னம், தகவல்=முகவரி)

    def தகவல்_உருப்படி(தன்) -> உருப்படி:
        return மொழிபெயர்க்கக்கூடிய_உரை(உள்ளீடு_உரையாக(தன்.தகவல்))


class மின்னஞ்சல்(தொடர்பு):
    def __init__(தன், முகவரி: str, சின்னம்="✉️"):
        super().__init__(சின்னம்=சின்னம், தகவல்=முகவரி)

    def தகவல்_உருப்படி(தன்) -> உருப்படி:
        return உரை(தன்.தகவல்)


class தொலைப்பேசி(தொடர்பு):
    def __init__(தன், எண்: str, சின்னம்="📞"):
        super().__init__(சின்னம்=சின்னம், தகவல்=எண்)

    def தகவல்_உருப்படி(தன்) -> உருப்படி:
        return எண்_உரை(தன்.தகவல்)
