from typing import Iterator

from .உருப்படி import உருப்படி
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class தலைப்பு(உருப்படி):
    உரை: str
    மூல்_மொழி: str

    def __init__(தன், உரை: str, மூல்_மொழி: str):
        super().__init__()
        தன்.உரை = உரை
        தன்.மூல்_மொழி = மூல்_மொழி

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=16, தடிமன்=True)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(இடைவெளி=0.3)
        yield பத்தி(
            [மொழிபெயர்க்கக்கூடிய_உரை(உரை=தன்.உரை, மூல்_மொழி=தன்.மூல்_மொழி, வடிவம்=வடிவம்)],
            வடிவம்=பத்தியின்_வடிவம்
        )
