from typing import Iterable

from odfdo import Element, Span

from .உரை import உரை
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவூட்டு import உரை_வடிவூட்டு, தேவையான_வடிவங்கள்


class புள்ளி(உரை):
    def __init__(தன், குறி: str, வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(உரை=குறி, வடிவூட்டு=வடிவூட்டு)

    def வெளியிடு(
            தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்
    ) -> Iterable[Element]:
        yield Span(தன்.உரை, style=தன்.வடிவூட்டு.பெயர்)


class கால்புள்ளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=",", வடிவூட்டு=வடிவூட்டு)


class முற்றுபுள்ளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=".", வடிவூட்டு=வடிவூட்டு)


class மூன்றுபுள்ளிகள்(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி="…", வடிவூட்டு=வடிவூட்டு)


class அரைகால்ப்புள்ளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=";", வடிவூட்டு=வடிவூட்டு)


class முக்கால்ப்புள்ளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=":", வடிவூட்டு=வடிவூட்டு)


class இடைவெளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=" ", வடிவூட்டு=வடிவூட்டு)


class பிரிக்க_முடியாத_இடைவெளி(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி=u"\u00A0", வடிவூட்டு=வடிவூட்டு)


class இணைப்புக்கோடு(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி="—", வடிவூட்டு=வடிவூட்டு)


class இணைப்புச்சிறுகோடு(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி="–", வடிவூட்டு=வடிவூட்டு)


class சாய்வு(புள்ளி):
    def __init__(தன், வடிவூட்டு: உரை_வடிவூட்டு = None):
        super().__init__(குறி="/", வடிவூட்டு=வடிவூட்டு)


class அடைப்பு(புள்ளி):
    def __init__(தன், நிலை: str, குறிகள்=None, வடிவூட்டு: உரை_வடிவூட்டு = None):
        if நிலை not in ["தொடக்கம்", "முடிவு"]:
            raise ValueError(நிலை)
        குறிகள் = குறிகள் or ["(", ")"]
        குறி = குறிகள்[0] if நிலை == "தொடக்கம்" else குறிகள்[1]

        super().__init__(குறி=குறி, வடிவூட்டு=வடிவூட்டு)


class பிறை_அடைப்பு(அடைப்பு):
    def __init__(தன், நிலை: str, வடிவூட்டு: உரை_வடிவூட்டு):
        super().__init__(நிலை, குறிகள்=["{", "}"], வடிவூட்டு=வடிவூட்டு)


class சதுர_அடைப்பு(அடைப்பு):
    def __init__(தன், நிலை: str, வடிவூட்டு: உரை_வடிவூட்டு):
        super().__init__(நிலை, குறிகள்=["[", "]"], வடிவூட்டு=வடிவூட்டு)
