from typing import Iterable

from odfdo import Element, Span

from .உரை import உரை
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவம் import உரை_வடிவம், தேவையான_வடிவங்கள்


class புள்ளி(உரை):
    def __init__(தன், குறி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(உரை=குறி, வடிவம்=வடிவம்)

    def வெளியிடு(
            தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்
    ) -> Iterable[Element]:
        yield Span(தன்.உரை, style=தன்.வடிவம்.பெயர்)


class கால்புள்ளி(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி=",", வடிவம்=வடிவம்)


class முற்றுபுள்ளி(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி=".", வடிவம்=வடிவம்)


class அரைகால்ப்புள்ளி(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி=";", வடிவம்=வடிவம்)


class இடைவெளி(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி=" ", வடிவம்=வடிவம்)


class முக்கால்ப்புள்ளி(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி=":", வடிவம்=வடிவம்)


class இணைப்புக்கோடு(புள்ளி):
    def __init__(தன், மொழி: str, வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி="—", வடிவம்=வடிவம்)


class இணைப்புச்சிறுகோடு(புள்ளி):
    def __init__(தன், வடிவம்: உரை_வடிவம் = None):
        super().__init__(குறி="–", வடிவம்=வடிவம்)


class அடைப்பு(புள்ளி):
    def __init__(தன், நிலை: str, குறிகள்=None, வடிவம்: உரை_வடிவம் = None):
        if நிலை not in ["தொடக்கம்", "முடிவு"]:
            raise ValueError(நிலை)
        குறிகள் = குறிகள் or ["(", ")"]
        குறி = குறிகள்[0] if நிலை == "தொடக்கம்" else குறிகள்[1]

        super().__init__(குறி=குறி, வடிவம்=வடிவம்)


class பிறை_அடைப்பு(அடைப்பு):
    def __init__(தன், நிலை: str, வடிவம்: உரை_வடிவம்):
        super().__init__(நிலை, குறிகள்=["{", "}"], வடிவம்=வடிவம்)


class சதுர_அடைப்பு(அடைப்பு):
    def __init__(தன், நிலை: str, மொழி: str, வடிவம்: உரை_வடிவம்):
        super().__init__(நிலை, குறிகள்=["[", "]"], வடிவம்=வடிவம்)
