from typing import Iterator

from .உருப்படி import உருப்படி
from .கருவிகள் import உள்ளீடு_உரை
from .மொழி_உரை import மொழிபெயர்ப்புடன்_உரை
from .பத்தி import பத்தி
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class பெயர்_தலைப்பு(உருப்படி):

    def __init__(தன், பெயர்: str or உள்ளீடு_உரை):
        super().__init__()
        தன்.பெயர் = பெயர் if isinstance(பெயர், உள்ளீடு_உரை) else உள்ளீடு_உரை(பெயர்)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=25)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0.5)
        yield பத்தி(
            [மொழிபெயர்ப்புடன்_உரை(தன்.பெயர்.உரை, மூல்_மொழி=தன்.பெயர்.மூல்_மொழி, மூல்_சாபி="பெயர்", வடிவம்=வடிவம்)],
            வடிவம்=பத்தியின்_வடிவம்
        )
