from typing import Iterator

from .உருப்படி import உருப்படி
from .மொழி_உரை import மொழிபெயர்ப்புடன்_உரை
from .பத்தி import பத்தி
from ..வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class பெயர்_தலைப்பு(உருப்படி):
    உரை: str
    மூல்_மொழி: str

    def __init__(தன், பெயர்: str, மூல்_மொழி: str):
        super().__init__()
        தன்.பெயர் = பெயர்
        தன்.மூல்_மொழி = மூல்_மொழி

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவம் = உரை_வடிவம்(அளவு=25)
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0.5)
        yield பத்தி(
            [மொழிபெயர்ப்புடன்_உரை(தன்.பெயர், மூல்_மொழி=தன்.மூல்_மொழி, மூல்_சாபி="பெயர்", வடிவம்=வடிவம்)],
            வடிவம்=பத்தியின்_வடிவம்
        )
