from typing import Iterator

from .உருப்படி import உருப்படி
from .கருவிகள் import உள்ளீடு_உரை
from .மொழி_உரை import மொழிபெயர்ப்புடன்_உரை
from .பத்தி import பத்தி
from ..வடிவூட்டு import உரை_வடிவூட்டு, பத்தி_வடிவூட்டு


class பெயர்_தலைப்பு(உருப்படி):

    def __init__(தன், பெயர்: str or உள்ளீடு_உரை):
        super().__init__()
        தன்.பெயர் = பெயர் if isinstance(பெயர், உள்ளீடு_உரை) else உள்ளீடு_உரை(பெயர்)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        வடிவூட்டு = உரை_வடிவூட்டு(அளவு=25)
        பத்தியின்_வடிவூட்டு = பத்தி_வடிவூட்டு(கீழ்_ஓரம்=0.5)
        yield பத்தி(
            [மொழிபெயர்ப்புடன்_உரை(உள்ளீடு_உரை(தன்.பெயர்.உரை, தன்.பெயர்.மூல்_மொழி), மூல்_சாபி="பெயர்", வடிவூட்டு=வடிவூட்டு)],
            வடிவூட்டு=பத்தியின்_வடிவூட்டு
        )
