from typing import Iterator, Iterable

from odfdo import Paragraph, Element

from .உருப்படி import உருப்படி
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவம் import தேவையான_வடிவங்கள், பத்தி_வடிவம்


class பத்தி(உருப்படி):
    def __init__(தன், உரைகள்: list[உருப்படி], வடிவம்: "பத்தி_வடிவம்"):
        super().__init__()
        தன்.வடிவம் = வடிவம்

        தன்.உரைகள்: list[உருப்படி] = [உரு for உரு in உரைகள் if உரு is not None] or []

    def மொழியாக்கத்துக்காக(தன்) -> dict[str, dict[str, str]]:
        return {}

    def உருப்படிகள்(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர்) -> Iterator["உருப்படி"]:
        for உரை in தன்.உரைகள்:
            yield உரை

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        வடிவங்கள்.சேரு(தன்.வடிவம்)
        உரை = super().வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)
        இந்த_பத்தி = Paragraph(style=தன்.வடிவம்.பெயர்)
        இந்த_பத்தி.extend(உரை)
        yield இந்த_பத்தி

    def __add__(தன், மற்ற: உருப்படி):
        தன்.உரைகள்.append(மற்ற)


