from datetime import datetime
from typing import Iterator, Optional, List

from .அட்டவணை import அட்டவணை, வரிசை, கலம்
from .உருப்படி import உருப்படி
from .எண் import எண்
from .கருவிகள் import உள்ளீடு_உரை
from .தேதி import தேதி
from .நிறுத்தற்குறிகள் import முக்கால்ப்புள்ளி, இடைவெளி, சாய்வு, இணைப்புக்கோடு, இணைப்புச்சிறுகோடு
from .பத்தி import பத்தி
from .மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை, மொழிபெயர்ப்புடன்_உரை
from ..வடிவூட்டு import பத்தி_வடிவூட்டு, உரை_வடிவூட்டு


class படிப்பு(உருப்படி):
    def __init__(தன், பட்டங்கள்: List["பட்டம்"]):
        super().__init__()
        தன்.பட்டங்கள் = பட்டங்கள்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield அட்டவணை([உ for ப in தன்.பட்டங்கள் for உ in ப.உருப்படிகள்()])


class பட்டம்_மேல்பார்வையாளர்(உருப்படி):
    def __init__(தன், பெயர்: str or உள்ளீடு_உரை, பதவி: Optional[str or உள்ளீடு_உரை]):
        super().__init__()
        தன்.பெயர் = பெயர் if isinstance(பெயர், உள்ளீடு_உரை) else உள்ளீடு_உரை(பெயர்)
        தன்.பதவி = பதவி if isinstance(பதவி, உள்ளீடு_உரை) else உள்ளீடு_உரை(பதவி)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield மொழிபெயர்க்கக்கூடிய_உரை(தன்.பெயர்)
        if தன்.பதவி:
            yield from [
                முக்கால்ப்புள்ளி(),
                இடைவெளி(),
                மொழிபெயர்க்கக்கூடிய_உரை(தன்.பதவி.உரை, மூல்_மொழி=தன்.பதவி.மூல்_மொழி)
            ]


class பட்டம்_மதிப்பெண்(உருப்படி):
    def __init__(தன், மதிப்பெண்: str or int or float, அதிகப்பட்ச_மதிப்பெண்: str or int or float):
        super().__init__()
        தன்.மதிப்பெண் = மதிப்பெண்
        தன்.அதிகப்பட்ச_மதிப்பெண் = அதிகப்பட்ச_மதிப்பெண்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield from [
            எண்(தன்.மதிப்பெண்),
            சாய்வு(),
            எண்(தன்.அதிகப்பட்ச_மதிப்பெண்),
        ]


class பட்டம்(உருப்படி):
    def __init__(
            தன்,
            பட்டம்: str,
            நிறுவனம்: str,
            இடம்: str,
            தேதிகள்: datetime or [datetime, datetime],
            மேல்பார்வையாளர்கள்: Optional[பட்டம்_மேல்பார்வையாளர் or List[பட்டம்_மேல்பார்வையாளர்]] = None,
            மதிப்பெண்: Optional[பட்டம்_மதிப்பெண்] = None
    ):
        super().__init__()
        தன்.பட்டம் = பட்டம் if isinstance(பட்டம், உள்ளீடு_உரை) else உள்ளீடு_உரை(பட்டம்)
        தன்.நிறுவனம் = நிறுவனம் if isinstance(நிறுவனம், உள்ளீடு_உரை) else உள்ளீடு_உரை(நிறுவனம்)
        தன்.இடம் = இடம் if isinstance(இடம், உள்ளீடு_உரை) else உள்ளீடு_உரை(இடம்)
        தன்.தேதிகள் = தேதிகள்
        தன்.மேல்பார்வையாளர்கள் = மேல்பார்வையாளர்கள்
        தன்.மதிப்பெண் = மதிப்பெண்

    def உருப்படிகள்(தன்) -> Iterator["வரிசை"]:
        பத்தியின்_வடிவூட்டு = பத்தி_வடிவூட்டு(மேல்_ஓரம்=0, கீழ்_ஓரம்=0)

        yield வரிசை([
            கலம்([பத்தி([
                மொழிபெயர்க்கக்கூடிய_உரை(தன்.நிறுவனம்.உரை, தன்.நிறுவனம்.மூல்_மொழி, வடிவூட்டு=உரை_வடிவூட்டு(தடிமன்=True))
            ], வடிவூட்டு=பத்தி_வடிவூட்டு(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0))]),
            கலம்([பத்தி([மொழிபெயர்ப்புடன்_உரை(தன்.இடம்.உரை, தன்.இடம்.மூல்_மொழி)], வடிவூட்டு=பத்தி_வடிவூட்டு(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0, ஒழுங்கு="வலது"))]),
        ])

        yield வரிசை([
            கலம்([
                பத்தி([மொழிபெயர்க்கக்கூடிய_உரை(தன்.பட்டம்.உரை, தன்.பட்டம்.மூல்_மொழி)], வடிவூட்டு=பத்தியின்_வடிவூட்டு),
                பத்தி(தன்.மதிப்பெண்.உருப்படிகள்(), வடிவூட்டு=பத்தியின்_வடிவூட்டு)
            ]),
            கலம்([பத்தி([
                தேதி(தன்.தேதிகள்[0]), இடைவெளி(), இணைப்புச்சிறுகோடு(), இடைவெளி(), தேதி(தன்.தேதிகள்[1])
            ], வடிவூட்டு=பத்தி_வடிவூட்டு(மேல்_ஓரம்=0, கீழ்_ஓரம்=0, ஒழுங்கு="வலது"))]),
        ])
