import base64
from hashlib import sha256
from typing import Iterable, Iterator, List

from odfdo import Element

from .உரை import உரை
from .நிறுத்தற்குறிகள் import சதுர_அடைப்பு, இடைவெளி
from ..மொழிபெயர்ப்பாளர்.தகவல்கள் import மொழியாக்க_தகவல்
from ..மொழிபெயர்ப்பாளர்.மொழிபெயர்ப்பாளர் import மொழிபெயர்ப்பாளர்
from ..வடிவம் import உரை_வடிவம், தேவையான_வடிவங்கள்


class மொழிபெயர்க்கக்கூடிய_உரை(உரை):
    def __init__(தன், உரை: str, மூல்_மொழி: str, மூல்_சாபி: str or List[str] = None, வடிவம்: உரை_வடிவம் = None):
        super().__init__(உரை=உரை, வடிவம்=வடிவம்)
        தன்.மூல்_மொழி = மூல்_மொழி
        if மூல்_சாபி is None:
            தன்.மூல்_சாபி = []
        else:
            தன்.மூல்_சாபி = [மூல்_சாபி] if isinstance(மூல்_சாபி, str) else மூல்_சாபி

        சாபி = base64.b64encode(sha256(தன்.உரை.encode("utf-8")).digest()).decode('ASCII')
        சாபி = சாபி if len(சாபி) < len(உரை) or "." in உரை else உரை
        தன்.சாபி = ".".join([*தன்.மூல்_சாபி, சாபி])

    def மொழியாக்கத்துக்காக(தன்) -> Iterator[மொழியாக்க_தகவல்]:
        yield மொழியாக்க_தகவல்(சாபி=தன்.சாபி, மூல்_மொழி=தன்.மூல்_மொழி, உரை=தன்.உரை)

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        மொழிபெயர்க்கப்பட்ட_உரை = மொழியாக்கம்(சாபி=தன்.சாபி, மொழி=மொழி)
        if மொழிபெயர்க்கப்பட்ட_உரை:
            yield from உரை(
                மொழிபெயர்க்கப்பட்ட_உரை, வடிவம்=தன்.வடிவம்
            ).வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)
        else:
            yield from super().வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)


class மொழிபெயர்ப்புடன்_உரை(மொழிபெயர்க்கக்கூடிய_உரை):

    def வெளியிடு(தன், மொழி: str, மொழியாக்கம்: மொழிபெயர்ப்பாளர், வடிவங்கள்: தேவையான_வடிவங்கள்) -> Iterable[Element]:
        yield from உரை(தன்.உரை, வடிவம்=தன்.வடிவம்).வெளியிடு(மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்)
        if மொழி != தன்.மூல்_மொழி:
            மொழிபெயர்க்கப்பட்ட_உரை = மொழியாக்கம்(சாபி=தன்.சாபி, மொழி=மொழி)
            if மொழிபெயர்க்கப்பட்ட_உரை and தன்.உரை != மொழிபெயர்க்கப்பட்ட_உரை:
                மொழிபெயர்ப்பின்_வடிவம் = தன்.வடிவம்.சாய்வு()
                yield from இடைவெளி(வடிவம்=தன்.வடிவம்).வெளியிடு(
                    மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்
                )
                yield from சதுர_அடைப்பு("தொடக்கம்", வடிவம்=மொழிபெயர்ப்பின்_வடிவம்).வெளியிடு(
                    மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம்,வடிவங்கள்=வடிவங்கள்
                )
                yield from உரை(மொழிபெயர்க்கப்பட்ட_உரை, வடிவம்=மொழிபெயர்ப்பின்_வடிவம்).வெளியிடு(
                    மொழி=மொழி,மொழியாக்கம்=மொழியாக்கம், வடிவங்கள்=வடிவங்கள்
                )
                yield from சதுர_அடைப்பு("முடிவு", வடிவம்=மொழிபெயர்ப்பின்_வடிவம்).வெளியிடு(
                    மொழி=மொழி, மொழியாக்கம்=மொழியாக்கம்,வடிவங்கள்=வடிவங்கள்
                )
