from typing import Iterator

from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.உரை import உரை
from தன்விவரங்கள்.உருப்படி.நிறுத்தற்குறிகள் import இடைவெளி, கால்புள்ளி, முக்கால்ப்புள்ளி
from தன்விவரங்கள்.உருப்படி.பத்தி import பத்தி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை
from தன்விவரங்கள்.வடிவம் import உரை_வடிவம், பத்தி_வடிவம்


class மொழிகள்(உருப்படி):
    def __init__(தன், நிலை: str, தெரிந்த_மொழிகள்: list[str], மூல்_மொழி: str, வடிவம்: "உரை_வடிவம்" = None):
        super().__init__()
        தன்.நிலை = நிலை
        தன்.தெரிந்த_மொழிகள் = தெரிந்த_மொழிகள்
        தன்.மூல்_மொழி = மூல்_மொழி
        தன்.வடிவம் = வடிவம் or உரை_வடிவம்()

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0.1)
        மொழி_பட்டியல் = []
        for இ, மொழி in enumerate(தன்.தெரிந்த_மொழிகள்):
            மொழி_பட்டியல்.append(உரை(மொழி, வடிவம்=தன்.வடிவம்))

            if len(தன்.தெரிந்த_மொழிகள்) > 1:
                if இ < (len(தன்.தெரிந்த_மொழிகள்) - 1):
                    மொழி_பட்டியல்.extend([கால்புள்ளி(வடிவம்=தன்.வடிவம்), இடைவெளி()])
                if இ == (len(தன்.தெரிந்த_மொழிகள்) - 2):
                    மொழி_பட்டியல்.extend([
                        மொழிபெயர்க்கக்கூடிய_உரை(
                            உரை="மற்றும்", மூல்_மொழி="த", மூல்_சாபி="மொழிகள்", வடிவம்=தன்.வடிவம்.சாய்வு()
                        ),
                        இடைவெளி(தன்.வடிவம்.சாய்வு()),
                    ])

        yield பத்தி(
            [
                மொழிபெயர்க்கக்கூடிய_உரை(
                    உரை=தன்.நிலை, மூல்_மொழி=தன்.மூல்_மொழி, மூல்_சாபி="மொழிகள்", வடிவம்=தன்.வடிவம்.தடிமன்()
                ),
                முக்கால்ப்புள்ளி(வடிவம்=தன்.வடிவம்.தடிமன்()),
                இடைவெளி(),
                *மொழி_பட்டியல்
            ],
            வடிவம்=பத்தியின்_வடிவம்
        )
