import uuid

from odfdo import Span, Style


class உரை_வடிவம்(object):
    def __init__(தன், அளவு=12, சாய்வு=False, அடிக்கோடு=False, தடிமன்=False, குடும்பம்="Sans"):
        தன்.பெயர் = str(uuid.uuid4())
        தன்.வடிவம் = {
            "சாய்வு": சாய்வு,
            "அடிக்கோடு": அடிக்கோடு,
            "தடிமன்": தடிமன்,
            "குடும்பம்": குடும்பம்,
            "அளவு": அளவு,
        }

    def சாய்வு(தன்):
        வடிவம் = தன்.வடிவம்.copy()
        வடிவம்["சாய்வு"] = not தன்.வடிவம்["சாய்வு"]
        return உரை_வடிவம்(**வடிவம்)

    def அடிக்கோடு(தன்):
        வடிவம் = தன்.வடிவம்.copy()
        வடிவம்["அடிக்கோடு"] = not தன்.வடிவம்["அடிக்கோடு"]
        return உரை_வடிவம்(**வடிவம்)

    def தடிமன்(தன்):
        வடிவம் = தன்.வடிவம்.copy()
        வடிவம்["தடிமன்"] = not தன்.வடிவம்["தடிமன்"]
        return உரை_வடிவம்(**வடிவம்)


class தேவையான_வடிவங்கள்(object):
    def __init__(தன்):
        தன்.வடிவங்கள் = set()

    def சேரு(தன், வடிவம்: உரை_வடிவம்):
        தன்.வடிவங்கள்.add(Style(
            family="text",
            name=வடிவம்.பெயர்,
            display_name=வடிவம்.பெயர்,
            italic=வடிவம்.வடிவம்["சாய்வு"],
            underline=வடிவம்.வடிவம்["அடிக்கோடு"],
            bold=வடிவம்.வடிவம்["தடிமன்"],
            size=str(வடிவம்.வடிவம்["அளவு"]) + "pt",
        ))