import uuid

from odfdo import Style


class வடிவூட்டு(object):
    def __init__(தன்):
        தன்.பெயர் = str(uuid.uuid4())


class உரை_வடிவூட்டு(வடிவூட்டு):
    def __init__(தன், அளவு=12, சாய்வு=False, அடிக்கோடு=False, தடிமன்=False, குடும்பம்="Sans"):
        super().__init__()
        தன்.வடிவூட்டு = {
            "சாய்வு": சாய்வு,
            "அடிக்கோடு": அடிக்கோடு,
            "தடிமன்": தடிமன்,
            "குடும்பம்": குடும்பம்,
            "அளவு": அளவு,
        }

    def சாய்வு(தன்):
        வடிவூட்டு = தன்.வடிவூட்டு.copy()
        வடிவூட்டு["சாய்வு"] = not தன்.வடிவூட்டு["சாய்வு"]
        return உரை_வடிவூட்டு(**வடிவூட்டு)

    def அடிக்கோடு(தன்):
        வடிவூட்டு = தன்.வடிவூட்டு.copy()
        வடிவூட்டு["அடிக்கோடு"] = not தன்.வடிவூட்டு["அடிக்கோடு"]
        return உரை_வடிவூட்டு(**வடிவூட்டு)

    def தடிமன்(தன்):
        வடிவூட்டு = தன்.வடிவூட்டு.copy()
        வடிவூட்டு["தடிமன்"] = not தன்.வடிவூட்டு["தடிமன்"]
        return உரை_வடிவூட்டு(**வடிவூட்டு)


class பத்தி_வடிவூட்டு(வடிவூட்டு):
    def __init__(தன், உள்தள்ளல்=0, ஒழுங்கு=None, கீழ்_ஓரம்=10, மேல்_ஓரம்=0):
        super().__init__()
        தன்.ஒழுங்கு = ஒழுங்கு
        தன்.உள்தள்ளல் = உள்தள்ளல்
        தன்.மேல்_ஓரம் = மேல்_ஓரம்
        தன்.கீழ்_ஓரம் = கீழ்_ஓரம்


class தேவையான_வடிவங்கள்(object):
    def __init__(தன்):
        தன்.வடிவங்கள் = set()

    def சேரு(தன், வடிவூட்டு: வடிவூட்டு):
        if isinstance(வடிவூட்டு, உரை_வடிவூட்டு):
            தன்.வடிவங்கள்.add(Style(
                family="text",
                name=வடிவூட்டு.பெயர்,
                display_name=வடிவூட்டு.பெயர்,
                italic=வடிவூட்டு.வடிவூட்டு["சாய்வு"],
                underline=வடிவூட்டு.வடிவூட்டு["அடிக்கோடு"],
                bold=வடிவூட்டு.வடிவூட்டு["தடிமன்"],
                size=str(வடிவூட்டு.வடிவூட்டு["அளவு"]) + "pt",
                **{
                    "style:font-size-complex": str(வடிவூட்டு.வடிவூட்டு["அளவு"]) + "pt",
                    "style:font-size-asian": str(வடிவூட்டு.வடிவூட்டு["அளவு"]) + "pt",
                    "style:font-name": "DejaVu Sans" if வடிவூட்டு.வடிவூட்டு["குடும்பம்"] == "Sans" else "DejaVu Serif",
                    "style:font-name-asian": "DejaVu Sans" if வடிவூட்டு.வடிவூட்டு["குடும்பம்"] == "Sans" else "DejaVu Serif",
                    "style:font-name-complex": "DejaVu Sans" if வடிவூட்டு.வடிவூட்டு["குடும்பம்"] == "Sans" else "DejaVu Serif"

                }
            ))
        elif isinstance(வடிவூட்டு, பத்தி_வடிவூட்டு):
            தன்.வடிவங்கள்.add(Style(
                family="paragraph",
                name=வடிவூட்டு.பெயர்,
                display_name=வடிவூட்டு.பெயர்,
                align="left" if வடிவூட்டு.ஒழுங்கு == "இடது" else "right" if வடிவூட்டு.ஒழுங்கு == "வலது" else "justify",
                margin_top=str(வடிவூட்டு.மேல்_ஓரம்) + "cm",
                margin_bottom=str(வடிவூட்டு.கீழ்_ஓரம்) + "cm",
                text_indent=str(வடிவூட்டு.உள்தள்ளல்) + "cm",
                margin_left=str(-வடிவூட்டு.உள்தள்ளல்) + "cm" if வடிவூட்டு.உள்தள்ளல் < 0 else "0cm"
            ))
        else:
            raise TypeError(வடிவூட்டு)
