import json
from hashlib import sha256

import unicodedata as ud
from odfdo import Style


class வடிவம்(object):
    def __init__(தன், வடிவம்_: dict):
        தன்.வடிவம் = வடிவம்_
        தன்.பெயர் = sha256(json.dumps(தன்.வடிவம், sort_keys=True).encode()).hexdigest()


class உரை_வடிவம்(வடிவம்):
    def __init__(தன், அளவு=10, சாய்வு=False, அடிக்கோடு=False, தடிமன்=False, குடும்பம்="Sans"):
        super().__init__({
            "சாய்வு": சாய்வு,
            "அடிக்கோடு": அடிக்கோடு,
            "தடிமன்": தடிமன்,
            "குடும்பம்": குடும்பம்,
            "அளவு": அளவு,
        })

    def சாய்வு(தன்):
        வடிவம்_ = தன்.வடிவம்.copy()
        வடிவம்_["சாய்வு"] = not தன்.வடிவம்["சாய்வு"]
        return உரை_வடிவம்(**வடிவம்_)

    def அடிக்கோடு(தன்):
        வடிவம்_ = தன்.வடிவம்.copy()
        வடிவம்_["அடிக்கோடு"] = not தன்.வடிவம்["அடிக்கோடு"]
        return உரை_வடிவம்(**வடிவம்_)

    def தடிமன்(தன்):
        வடிவம்_ = தன்.வடிவம்.copy()
        வடிவம்_["தடிமன்"] = not தன்.வடிவம்["தடிமன்"]
        return உரை_வடிவம்(**வடிவம்_)


class பத்தி_வடிவம்(வடிவம்):
    def __init__(
            தன், உள்தள்ளல்=0, ஒழுங்கு="ஆரம்பம்", கீழ்_ஓரம்=0, மேல்_ஓரம்=0, ஆரம்ப_தள்ளல்=0, இறுதி_தள்ளல்=0
    ):
        super().__init__({
            "ஒழுங்கு": ஒழுங்கு,
            "உள்தள்ளல்": உள்தள்ளல்,
            "மேல்_ஓரம்": மேல்_ஓரம்,
            "கீழ்_ஓரம்": கீழ்_ஓரம்,
            "ஆரம்ப_தள்ளல்": ஆரம்ப_தள்ளல்,
            "இறுதி_தள்ளல்": இறுதி_தள்ளல்,
        })


class தேவையான_வடிவங்கள்(object):
    def __init__(தன்):
        தன்.வடிவங்கள் = set()

    def சேரு(தன், வடிவம்: வடிவம், மொழி: str):
        if isinstance(வடிவம், உரை_வடிவம்):
            தன்.வடிவங்கள்.add(
                Style(
                    family="text",
                    name=வடிவம்.பெயர்,
                    display_name=வடிவம்.பெயர்,
                    italic=வடிவம்.வடிவம்["சாய்வு"],
                    underline=வடிவம்.வடிவம்["அடிக்கோடு"],
                    bold=வடிவம்.வடிவம்["தடிமன்"],
                    size=str(வடிவம்.வடிவம்["அளவு"]) + "pt",
                    **{
                        "style:font-size-complex": str(வடிவம்.வடிவம்["அளவு"]) + "pt",
                        "style:font-size-asian": str(வடிவம்.வடிவம்["அளவு"]) + "pt",
                        "style:font-name": "DejaVu Sans"
                        if வடிவம்.வடிவம்["குடும்பம்"] == "Sans"
                        else "DejaVu Serif",
                        "style:font-name-asian": "DejaVu Sans"
                        if வடிவம்.வடிவம்["குடும்பம்"] == "Sans"
                        else "DejaVu Serif",
                        "style:font-name-complex": "DejaVu Sans"
                        if வடிவம்.வடிவம்["குடும்பம்"] == "Sans"
                        else "DejaVu Serif",
                    },
                )
            )
        elif isinstance(வடிவம், பத்தி_வடிவம்):
            மொழி_திசை_இடத்திலிருந்து = ud.bidirectional(மொழி[0]) == "L"
            இடது_உள்தள்ளல் = (
                    str((-வடிவம்.வடிவம்["உள்தள்ளல்"] if வடிவம்.வடிவம்["உள்தள்ளல்"] < 0 else 0) + வடிவம்.வடிவம்[
                        "ஆரம்ப_தள்ளல்"]) + "cm"
            )
            வலது_உள்தள்ளல் = "0cm"

            if மொழி_திசை_இடத்திலிருந்து:
                ஒழுங்குபடுத்தல் = (
                    "start"
                    if வடிவம்.வடிவம்["ஒழுங்கு"] == "ஆரம்பம்"
                    else "end"
                    if வடிவம்.வடிவம்["ஒழுங்கு"] == "இறுதி"
                    else "justify"
                )
                திசை = "lr-tb"

            else:
                ஒழுங்குபடுத்தல் = (
                    "end"
                    if வடிவம்.வடிவம்["ஒழுங்கு"] == "ஆரம்பம்"
                    else "start"
                    if வடிவம்.வடிவம்["ஒழுங்கு"] == "இறுதி"
                    else "justify"
                )
                திசை = "rl-tb"

            தன்.வடிவங்கள்.add(
                Style(
                    family="paragraph",
                    name=வடிவம்.பெயர்,
                    display_name=வடிவம்.பெயர்,
                    margin_top=str(வடிவம்.வடிவம்["மேல்_ஓரம்"]) + "cm",
                    margin_bottom=str(வடிவம்.வடிவம்["கீழ்_ஓரம்"]) + "cm",
                    text_indent=str(வடிவம்.வடிவம்["உள்தள்ளல்"]) + "cm",
                    margin_left=இடது_உள்தள்ளல்,
                    margin_right=வலது_உள்தள்ளல்,
                    **{"text-align": ஒழுங்குபடுத்தல், "style:writing-mode": திசை},
                )
            )
        else:
            raise TypeError(வடிவம்)
