from datetime import datetime
from typing import Optional, Iterator

from தன்விவரங்கள்.உருப்படி.இணைப்பு import இணைப்பு
from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.உரை import உரை
from தன்விவரங்கள்.உருப்படி.கருவிகள் import உள்ளீடு_உரை, உள்ளீடு_உரையாக
from தன்விவரங்கள்.உருப்படி.தேதி import தேதி, தேதி_இடைவெளி
from தன்விவரங்கள்.உருப்படி.நிறுத்தற்குறிகள் import முக்கால்ப்புள்ளி, இடைவெளி
from தன்விவரங்கள்.உருப்படி.பத்தி import பத்தி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை, மொழிபெயர்ப்புடன்_உரை
from தன்விவரங்கள்.வடிவம் import பத்தி_வடிவம், உரை_வடிவம்


class கற்பித்தல்(உருப்படி):
    def __init__(
        தன்,
        தலைப்பு: str or உள்ளீடு_உரை,
        தேதிகள்: (datetime | தேதி) or [datetime | தேதி, datetime | தேதி],
        நிறுவனம்: Optional[str | உள்ளீடு_உரை] = None,
        மொழி: Optional[str | உள்ளீடு_உரை] = None,
        விவரங்கள்: Optional[str | உள்ளீடு_உரை] = None,
    ):
        super().__init__()
        தன்.தலைப்பு = தலைப்பு
        தன்.தேதிகள் = தேதிகள்
        தன்.நிறுவனம் = நிறுவனம்
        தன்.மொழி = மொழி
        தன்.விவரங்கள் = விவரங்கள்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield பத்தி(
            [மொழிபெயர்ப்புடன்_உரை(உள்ளீடு_உரையாக(தன்.தலைப்பு), வடிவம்=உரை_வடிவம்(தடிமன்=True))],
            பத்தி_வடிவம்(),
        )
        if தன்.விவரங்கள்:
            yield பத்தி(
                [மொழிபெயர்க்கக்கூடிய_உரை(உள்ளீடு_உரையாக(தன்.விவரங்கள்))],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5, கீழ்_ஓரம்=0.5 if not தன்.தேதிகள் and not தன்.நிறுவனம் and not தன்.மொழி else 0),
            )
        if தன்.தேதிகள்:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(
                        உள்ளீடு_உரையாக("தேதிகள்"),
                        மூல்_சாபி="பொது",
                        வடிவம்=உரை_வடிவம்(தடிமன்=True),
                    ),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    தேதி_இடைவெளி(*தன்.தேதிகள்),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5, கீழ்_ஓரம்=0.5 if not தன்.நிறுவனம் and not தன்.மொழி else 0),
            )

        if தன்.நிறுவனம்:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(
                        உள்ளீடு_உரையாக("நிறுவனம்"),
                        மூல்_சாபி="கற்பித்தல்",
                        வடிவம்=உரை_வடிவம்(தடிமன்=True),
                    ),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    இணைப்பு(தன்.நிறுவனம்),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5, கீழ்_ஓரம்=0.5 if not தன்.மொழி else 0),
            )

        if தன்.மொழி:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(
                        உள்ளீடு_உரையாக("மொழி"), மூல்_சாபி="பொது", வடிவம்=உரை_வடிவம்(தடிமன்=True)
                    ),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    உரை(தன்.மொழி),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5, கீழ்_ஓரம்=0.5),
            )
