from datetime import datetime
from typing import Iterator, Optional, List, Iterable

from தன்விவரங்கள்.உருப்படி.அட்டவணை import அட்டவணை, வரிசை, கலம்
from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.எண் import எண்
from தன்விவரங்கள்.உருப்படி.கருவிகள் import உள்ளீடு_உரை, உள்ளீடு_உரையாக
from தன்விவரங்கள்.உருப்படி.தேதி import தேதி
from தன்விவரங்கள்.உருப்படி.நிறுத்தற்குறிகள் import முக்கால்ப்புள்ளி, இடைவெளி, சாய்வு, இணைப்புச்சிறுகோடு
from தன்விவரங்கள்.உருப்படி.பத்தி import பத்தி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை, மொழிபெயர்ப்புடன்_உரை
from தன்விவரங்கள்.வடிவம் import பத்தி_வடிவம், உரை_வடிவம்


class படிப்பு(உருப்படி):
    def __init__(தன், பட்டங்கள்: List["பட்டம்"]):
        super().__init__()
        தன்.பட்டங்கள் = பட்டங்கள்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield அட்டவணை([உ for ப in தன்.பட்டங்கள் for உ in ப.உருப்படிகள்()])


class பட்டம்_மேல்பார்வையாளர்(உருப்படி):
    def __init__(
        தன்,
        பெயர்: str or உள்ளீடு_உரை,
        பதவி: Optional[str or உள்ளீடு_உரை] = None,
        பங்கு: Optional[str or உள்ளீடு_உரை] = "மேர்பார்வையாளர்",
    ):
        super().__init__()
        தன்.பெயர் = உள்ளீடு_உரையாக(பெயர்)
        தன்.பதவி = உள்ளீடு_உரையாக(பதவி)
        தன்.பங்கு = உள்ளீடு_உரையாக(பங்கு)

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        பங்கு_பத்தி_வடிவம் = பத்தி_வடிவம்(கீழ்_ஓரம்=0)
        yield பத்தி([மொழிபெயர்க்கக்கூடிய_உரை(தன்.பங்கு, மூல்_சாபி="படிப்பு")], பங்கு_பத்தி_வடிவம்)

        yield பத்தி(
            [
                மொழிபெயர்க்கக்கூடிய_உரை(தன்.பெயர், மூல்_சாபி="படிப்பு"),
                *(
                    [
                        முக்கால்ப்புள்ளி(),
                        இடைவெளி(),
                        மொழிபெயர்க்கக்கூடிய_உரை(தன்.பதவி, மூல்_சாபி="படிப்பு"),
                    ]
                    if தன்.பதவி
                    else []
                ),
            ],
            பத்தி_வடிவம்(கீழ்_ஓரம்=0, ஆரம்ப_தள்ளல்=1),
        )


class பட்டம்_மதிப்பெண்(உருப்படி):
    def __init__(
        தன், மதிப்பெண்: str or int or float, அதிகப்பட்ச_மதிப்பெண்: str or int or float
    ):
        super().__init__()
        தன்.மதிப்பெண் = மதிப்பெண்
        தன்.அதிகப்பட்ச_மதிப்பெண் = அதிகப்பட்ச_மதிப்பெண்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield from [
            எண்(தன்.மதிப்பெண்),
            சாய்வு(),
            எண்(தன்.அதிகப்பட்ச_மதிப்பெண்),
        ]


class பட்டம்(உருப்படி):
    def __init__(
        தன்,
        பட்டம்: str or உள்ளீடு_உரை,
        நிறுவனம்: str or உள்ளீடு_உரை,
        இடம்: str or உள்ளீடு_உரை,
        தேதிகள்: datetime or [datetime, datetime],
        ஆய்வறிக்கை: Optional[str or உள்ளீடு_உரை] = None,
        மேல்பார்வையாளர்கள்: Optional[பட்டம்_மேல்பார்வையாளர் or Iterable[பட்டம்_மேல்பார்வையாளர்]] = None,
        மதிப்பெண்: Optional[பட்டம்_மதிப்பெண்] = None,
    ):
        super().__init__()
        தன்.பட்டம் = உள்ளீடு_உரையாக(பட்டம்)
        தன்.நிறுவனம் = உள்ளீடு_உரையாக(நிறுவனம்)
        தன்.இடம் = உள்ளீடு_உரையாக(இடம்)
        தன்.தேதிகள் = தேதிகள்
        தன்.ஆய்வறிக்கை = உள்ளீடு_உரையாக(ஆய்வறிக்கை) if ஆய்வறிக்கை is not None else None
        தன்.மேல்பார்வையாளர்கள் = (
            [மேல்பார்வையாளர்கள்]
            if isinstance(மேல்பார்வையாளர்கள், பட்டம்_மேல்பார்வையாளர்)
            else மேல்பார்வையாளர்கள்
        )
        தன்.மதிப்பெண் = மதிப்பெண்

    def உருப்படிகள்(தன்) -> Iterator["வரிசை"]:
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(மேல்_ஓரம்=0, கீழ்_ஓரம்=0)

        நிறுவனம்_கலம் = கலம்(
            [
                பத்தி(
                    [
                        மொழிபெயர்ப்புடன்_உரை(
                            தன்.நிறுவனம், வடிவம்=உரை_வடிவம்(தடிமன்=True), மூல்_சாபி="படிப்பு"
                        )
                    ],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0.1, கீழ்_ஓரம்=0),
                )
            ]
        )
        இடம்_கலம் = கலம்(
            [
                பத்தி(
                    [மொழிபெயர்ப்புடன்_உரை(தன்.இடம், மூல்_சாபி="படிப்பு")],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0.1, கீழ்_ஓரம்=0, ஒழுங்கு="இறுதி"),
                )
            ]
        )

        yield வரிசை([நிறுவனம்_கலம், இடம்_கலம்])

        விவரங்கள்_கலம் = கலம்(
            [
                பத்தி(
                    [மொழிபெயர்க்கக்கூடிய_உரை(தன்.பட்டம், மூல்_சாபி="படிப்பு")],
                    வடிவம்=பத்தியின்_வடிவம்,
                ),
                *(
                    [
                        பத்தி(
                            [
                                மொழிபெயர்க்கக்கூடிய_உரை(
                                    உள்ளீடு_உரை("ஆய்வறிக்கை", "த"), மூல்_சாபி="படிப்பு"
                                )
                            ],
                            வடிவம்=பத்தியின்_வடிவம்,
                        ),
                        பத்தி(
                            [மொழிபெயர்ப்புடன்_உரை(தன்.ஆய்வறிக்கை, மூல்_சாபி="படிப்பு")],
                            வடிவம்=பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=1),
                        ),
                    ]
                    if தன்.ஆய்வறிக்கை
                    else []
                ),
                *(
                    [
                        உரு
                        for மேர்பார்வையாளர் in தன்.மேல்பார்வையாளர்கள்
                        for உரு in மேர்பார்வையாளர்.உருப்படிகள்()
                    ]
                    if தன்.மேல்பார்வையாளர்கள்
                    else []
                ),
                பத்தி(தன்.மதிப்பெண்.உருப்படிகள்(), வடிவம்=பத்தியின்_வடிவம்),
            ]
        )
        தேதிகள்_கலம் = கலம்(
            [
                பத்தி(
                    [
                        தேதி(தன்.தேதிகள்[0]),
                        இடைவெளி(),
                        இணைப்புச்சிறுகோடு(),
                        இடைவெளி(),
                        தேதி(தன்.தேதிகள்[1]),
                    ],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0, கீழ்_ஓரம்=0, ஒழுங்கு="இறுதி"),
                )
            ]
        )

        yield வரிசை([விவரங்கள்_கலம், தேதிகள்_கலம்])
