from typing import Optional, Iterator

from தன்விவரங்கள்.உருப்படி.இணைப்பு import இணைப்பு
from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.கருவிகள் import உள்ளீடு_உரை, உள்ளீடு_உரையாக
from தன்விவரங்கள்.உருப்படி.நிறுத்தற்குறிகள் import முக்கால்ப்புள்ளி, இடைவெளி
from தன்விவரங்கள்.உருப்படி.பத்தி import பத்தி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை, மொழிபெயர்ப்புடன்_உரை
from தன்விவரங்கள்.வடிவம் import பத்தி_வடிவம், உரை_வடிவம்


class மென்பொருள்(உருப்படி):
    def __init__(
        தன்,
        பெயர்: str or உள்ளீடு_உரை,
        விவரங்கள்: Optional[str | உள்ளீடு_உரை] = None,
        குறியீடு: Optional[str] = None,
        ஆவணங்கள்: Optional[str] = None,
        இணைப்பு: Optional[str] = None,
    ):
        super().__init__()
        தன்.பெயர் = பெயர்
        தன்.விவரங்கள் = விவரங்கள்
        தன்.குறியீடு = குறியீடு
        தன்.ஆவணங்கள் = ஆவணங்கள்
        தன்.இணைப்பு = இணைப்பு

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield பத்தி([மொழிபெயர்ப்புடன்_உரை(உள்ளீடு_உரையாக(தன்.பெயர்), வடிவம்=உரை_வடிவம்(தடிமன்=True))], பத்தி_வடிவம்(மேல்_ஓரம்=0.5))
        yield பத்தி(
            [மொழிபெயர்க்கக்கூடிய_உரை(உள்ளீடு_உரையாக(தன்.விவரங்கள்))],
            பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5),
        )
        if தன்.இணைப்பு:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(
                        உள்ளீடு_உரையாக("இணைப்பு"), மூல்_சாபி="மென்பொருள்", வடிவம்=உரை_வடிவம்(தடிமன்=True)
                    ),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    இணைப்பு(தன்.இணைப்பு),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5),
            )

        if தன்.ஆவணங்கள்:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(உள்ளீடு_உரையாக("ஆவணங்கள்"), மூல்_சாபி="மென்பொருள்", வடிவம்=உரை_வடிவம்(தடிமன்=True)),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    இணைப்பு(தன்.ஆவணங்கள்),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5),
            )

        if தன்.குறியீடு:
            yield பத்தி(
                [
                    மொழிபெயர்க்கக்கூடிய_உரை(
                        உள்ளீடு_உரையாக("மூல் குறியீடு"), மூல்_சாபி="மென்பொருள்", வடிவம்=உரை_வடிவம்(தடிமன்=True)
                    ),
                    முக்கால்ப்புள்ளி(உரை_வடிவம்(தடிமன்=True)),
                    இடைவெளி(),
                    இணைப்பு(தன்.குறியீடு),
                ],
                பத்தி_வடிவம்(ஆரம்ப_தள்ளல்=0.5, உள்தள்ளல்=-0.5),
            )
