from datetime import datetime
from typing import Iterable, Iterator, Optional

from தன்விவரங்கள்.உருப்படி.அட்டவணை import அட்டவணை, கலம், வரிசை
from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.கருவிகள் import உள்ளீடு_உரை, உள்ளீடு_உரையாக
from தன்விவரங்கள்.உருப்படி.தேதி import தேதி, தேதி_இடைவெளி
from தன்விவரங்கள்.உருப்படி.பத்தி import பத்தி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்க்கக்கூடிய_உரை, மொழிபெயர்ப்புடன்_உரை
from தன்விவரங்கள்.வடிவம் import பத்தி_வடிவம், உரை_வடிவம்


class வாழ்க்கைபோக்கு(உருப்படி):
    def __init__(தன், வேலைகள்: Iterable["வேலை"]):
        super().__init__()
        தன்.வேலைகள் = வேலைகள்

    def உருப்படிகள்(தன்) -> Iterator["உருப்படி"]:
        yield அட்டவணை([உ for ப in தன்.வேலைகள் for உ in ப.உருப்படிகள்()])


class வேலை(உருப்படி):
    def __init__(
            தன்,
            தலைப்பு: str or உள்ளீடு_உரை,
            நிறுவனம்: str or உள்ளீடு_உரை,
            இடம்: str or உள்ளீடு_உரை,
            தேதிகள்: (datetime | தேதி) or [datetime | தேதி, datetime | தேதி],
            விவரங்கள்: Optional[str or உள்ளீடு_உரை] = None,
    ):
        super().__init__()
        தன்.தலைப்பு = உள்ளீடு_உரையாக(தலைப்பு)
        தன்.நிறுவனம் = உள்ளீடு_உரையாக(நிறுவனம்)
        தன்.இடம் = இடம் if isinstance(இடம், உள்ளீடு_உரை) else உள்ளீடு_உரை(இடம்)
        தன்.தேதிகள் = (
            [தேதிகள், None]
            if isinstance(தேதிகள், datetime) or isinstance(தேதிகள், தேதி)
            else தேதிகள்
        )

        தன்.விவரங்கள் = உள்ளீடு_உரையாக(விவரங்கள்) if விவரங்கள் is not None else None

    def உருப்படிகள்(தன்) -> Iterator["வரிசை"]:
        பத்தியின்_வடிவம் = பத்தி_வடிவம்(மேல்_ஓரம்=0, கீழ்_ஓரம்=0)

        நிறுவனம்_கலம் = கலம்(
            [
                பத்தி(
                    [
                        மொழிபெயர்க்கக்கூடிய_உரை(
                            தன்.தலைப்பு, வடிவம்=உரை_வடிவம்(தடிமன்=True), மூல்_சாபி="வேலை"
                        )
                    ],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0),
                )
            ]
        )
        இடம்_கலம் = கலம்(
            [
                பத்தி(
                    [மொழிபெயர்ப்புடன்_உரை(தன்.இடம், மூல்_சாபி="வேலை")],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0.3, கீழ்_ஓரம்=0, ஒழுங்கு="இறுதி"),
                )
            ]
        )

        yield வரிசை([நிறுவனம்_கலம், இடம்_கலம்])

        விவரங்கள்_கலம் = கலம்(
            [
                பத்தி(
                    [மொழிபெயர்க்கக்கூடிய_உரை(தன்.நிறுவனம், மூல்_சாபி="வேலை")],
                    வடிவம்=பத்தியின்_வடிவம்,
                ),
                *(
                    [
                        பத்தி(
                            [
                                மொழிபெயர்க்கக்கூடிய_உரை(
                                    தன்.விவரங்கள்,
                                    வடிவம்=உரை_வடிவம்(சாய்வு=True),
                                    மூல்_சாபி="வேலை",
                                )
                            ],
                            வடிவம்=பத்தியின்_வடிவம்,
                        ),
                    ]
                    if தன்.விவரங்கள்
                    else []
                ),
            ]
        )
        தேதிகள்_கலம் = கலம்(
            [
                பத்தி(
                    [
                        தேதி_இடைவெளி(*தன்.தேதிகள்),
                    ],
                    வடிவம்=பத்தி_வடிவம்(மேல்_ஓரம்=0, கீழ்_ஓரம்=0, ஒழுங்கு="இறுதி"),
                )
            ]
        )

        yield வரிசை([விவரங்கள்_கலம், தேதிகள்_கலம்])
