from typing import List

from .வெளியீடு import வெளியீடு
from தன்விவரங்கள்.உருப்படி.உருப்படி import உருப்படி
from தன்விவரங்கள்.உருப்படி.கருவிகள் import எழுத்தாளர்_வடிவம், உள்ளீடு_உரை
from தன்விவரங்கள்.உருப்படி.தேதி import தேதி
from தன்விவரங்கள்.உருப்படி.நிறுத்தற்குறிகள் import முற்றுபுள்ளி, இடைவெளி
from தன்விவரங்கள்.உருப்படி.மொழி_உரை import மொழிபெயர்ப்புடன்_உரை


class நூல்(வெளியீடு):
    def __init__(தன், தகவல்கள்: dict[str, str], எழுத்தாளர்_வடிவூட்டி: எழுத்தாளர்_வடிவம் = None):
        super().__init__(தகவல்கள்=தகவல்கள், எழுத்தாளர்_வடிவூட்டி=எழுத்தாளர்_வடிவூட்டி)

    @classmethod
    @property
    def வகை_தலைப்பு(தன்) -> str:
        return "நூல்கள்"

    def வெளியீட்டின்_உருப்படிகள்(தன்) -> List["உருப்படி"]:
        எழுத்தாளர்கள் = தன்.எழுத்தாளர்களை_வெளியிடு()

        ஆண்டு = தேதி(தன்.ஆண்டு)
        தலைப்பு = மொழிபெயர்ப்புடன்_உரை(
            உரை=உள்ளீடு_உரை(தன்.தலைப்பு, தன்.வெளியீட்டின்_மொழி), மூல்_சாபி="வெளியீடு"
        )

        பத்தி_உரைகள் = [
            *எழுத்தாளர்கள்,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            ஆண்டு,
            முற்றுபுள்ளி(),
            இடைவெளி(),
            தலைப்பு,
            முற்றுபுள்ளி(),
        ]

        எண்ணிம_ஆவணச்சுட்டி = தன்.எண்ணிம_ஆவணச்சுட்டியை_வெளியிடு()
        if எண்ணிம_ஆவணச்சுட்டி:
            பத்தி_உரைகள்.extend([இடைவெளி(), *எண்ணிம_ஆவணச்சுட்டி])

        return பத்தி_உரைகள்
